let data = [
  {
    text: '综合零售',
    children : [
      { id: 5311, text: '百货商店' },
      { id: 5411, text: '综合性超级市场' },
      { id: 5331, text: '各类杂货店、便利店' },
      { id: 5399, text: '未列入其他代码的综合零售服务' }
    ]
  },
  {
    text: '食品、饮料及烟草制品专门零售',
    children : [
      { id: 5422, text: '肉类水产商店' },
      { id: 5441, text: '糖果及坚果商店' },
      { id: 5451, text: '乳制品商店' },
      { id: 5462, text: '面包房、糕点商店' },
      { id: 5499, text: '未列入其他代码的食品商店' },
      { id: 5921, text: '瓶装酒零售店' },
      { id: 5993, text: '香烟、雪茄专卖店' }
    ]
  },
  {
    text: '纺织、服装及日用品专门零售店',
    children : [
      { id: 5094, text: '贵重珠宝、首饰、钟表零售' },
      { id: 5944, text: '银器店' },
      { id: 5611, text: '男装商店' },
      { id: 5621, text: '女装商店' },
      { id: 5631, text: '女性饰品商店' },
      { id: 5641, text: '婴儿、儿童服装店' },
      { id: 5651, text: '服装综合零售店' },
      { id: 5655, text: '运动服饰商店' },
      { id: 5661, text: '鞋店' },
      { id: 5681, text: '皮货店' },
      { id: 5691, text: '成人成衣店' },
      { id: 5697, text: '服装定制及修补改衣店' },
      { id: 5698, text: '假发商店' },
      { id: 5699, text: '未列入其他代码的服饰商店' },
      { id: 5947, text: '礼品、纪念品、节日装饰品商店' },
      { id: 5948, text: '箱包、皮具店' },
      { id: 5949, text: '纺织品及针织品零售' },
      { id: 5950, text: '玻璃、陶瓷、水晶制品商店' },
      { id: 5970, text: '工艺美术商店' },
      { id: 5971, text: '艺术商和画廊' },
      { id: 5972, text: '邮票和纪念品商店' },
      { id: 5973, text: '宗教用品商店' },
      { id: 5975, text: '助听器销售' },
      { id: 5977, text: '化妆品商店' },
      { id: 5995, text: '宠物商店、宠物食品及用品' },
      { id: 8043, text: '光学仪器、眼镜店' }
    ]
  },
  {
    text: '文化、体育用品及器材专门零售',
    children : [
      { id: 5733, text: '乐器商店' },
      { id: 5735, text: '音像制品商店与音像产品下载' },
      { id: 5932, text: '古玩艺术品销售' },
      { id: 5937, text: '古玩复制店' },
      { id: 5940, text: '自行车商店' },
      { id: 5941, text: '运动器材装备商店' },
      { id: 5942, text: '书店' },
      { id: 5943, text: '文具商店' },
      { id: 5945, text: '玩具店' },
      { id: 5946, text: '摄影摄像器材商店' },
      { id: 5994, text: '报亭、报摊' },
      { id: 5996, text: '游泳池-销售、供应和服务' },
      { id: 7993, text: '电子游戏设备销售' }
    ]
  },
  {
    text: '医药和医疗器材专门零售',
    children : [{ id: 5912, text: '药房、药店' }, { id: 5976, text: '医疗器械' }]
  },
  {
    text: '汽车、摩托车、燃料及零配件专门零售',
    children : [
      { id: 5271, text: '活动房屋销售商' },
      { id: 5511, text: '汽车经销商' },
      { id: 5521, text: '二手车经销商' },
      { id: 5532, text: '汽车轮胎经销商' },
      { id: 5533, text: '汽车零配件商店' },
      { id: 5541, text: '加油、加气、充电站' },
      { id: 5542, text: '自助加油站' },
      { id: 5551, text: '船只经销商' },
      { id: 5561, text: '拖车销售商' },
      { id: 5571, text: '摩托车商店' },
      { id: 5592, text: '房车销售商' },
      { id: 5598, text: '雪车商' },
      { id: 5599, text: '未列入其他代码的机动车、飞行器、农业机械经销商' },
      { id: 5983, text: '燃料经销商（除机动车燃料）' }
    ]
  },
  {
    text: '家用电器及电子产品专门零售',
    children : [
      { id: 4812, text: '通讯设备销售' },
      { id: 5722, text: '家用电器商店' },
      { id: 5732, text: '电子设备商店' },
      { id: 5734, text: '计算机软件商店与软件下载' },
      { id: 5978, text: '打字机商店-销售、服务和出租' },
      { id: 5997, text: '电动剃刀商店-销售和服务' }
    ]
  },
  {
    text: '五金、家具及室内装修材料专门零售',
    children : [
      { id: 5211, text: '建材销售' },
      { id: 5231, text: '玻璃、油漆涂料、墙纸零售' },
      { id: 5251, text: '五金商店' },
      { id: 5261, text: '草坪、园艺用品商店' },
      { id: 5712, text: '家具及家居生活用品' },
      { id: 5713, text: '地板、地毯商店' },
      { id: 5714, text: '窗帘、遮阳棚商店' },
      { id: 5718, text: '壁炉、壁炉防护网及配件商店' },
      { id: 5719, text: '家庭装饰用品商店' },
      { id: 5992, text: '花店' }
    ]
  },
  {
    text: '其他零售商店',
    children : [
      { id: 5309, text: '免税商店' },
      { id: 5310, text: '折扣商店' },
      { id: 5931, text: '旧货及二手商品店' },
      { id: 5999, text: '未列入其他代码的专门零售店' }
    ]
  },
  {
    text: '餐饮业',
    children : [
      { id: 5812, text: '就餐场所和餐馆' },
      { id: 5813, text: '休闲饮品场所、酒吧、咖啡厅、茶馆' },
      { id: 5814, text: '快餐店' }
    ]
  },
  {
    text: '休闲娱乐业',
    children : [
      { id: 7032, text: '集体活动服务商，夏令营、拓展训练' },
      { id: 7033, text: '宿营场地' },
      { id: 7297, text: '按摩足疗店' },
      { id: 7298, text: '保健、美容及洗浴服务' },
      { id: 7829, text: '影视、音像制品创作、发行' },
      { id: 7832, text: '电影院' },
      { id: 7911, text: '歌舞厅、卡拉OK' },
      { id: 7922, text: '舞台演出服务及票务' },
      { id: 7929, text: '未列入其他代码的文艺表演、艺术创作' },
      { id: 7932, text: '台球娱乐场所' },
      { id: 7933, text: '保龄球馆' },
      { id: 7941, text: '运动比赛场馆、体育俱乐部、赛事推广' },
      { id: 7991, text: '观光与会展服务' },
      { id: 4733, text: '景区售票' },
      { id: 7992, text: '高尔夫球场' },
      { id: 7994, text: '大型游戏机和游戏场所' },
      { id: 7995, text: '彩票销售' },
      { id: 7996, text: '游乐园、马戏馆、嘉年华' },
      { id: 7997, text: '会员制体育健身俱乐部、会所' },
      { id: 7998, text: '动物园、海洋馆' },
      { id: 7999, text: '未列入其他代码的娱乐服务' }
    ]
  },
  {
    text: '居民服务',
    children : [
      { id: 4900, text: '公共事业（电力、煤气、自来水、清洁服务）' },
      { id: 7210, text: '洗衣店' },
      { id: 7211, text: '自助洗衣服务' },
      { id: 7216, text: '干洗店' },
      { id: 7217, text: '室内清洁服务（地毯、沙发、家具表面的清洁服务）' },
      { id: 7221, text: '照相馆、摄影工作室' },
      { id: 7230, text: '理发店' },
      { id: 7261, text: '殡葬、墓地服务' },
      { id: 7273, text: '婚恋服务与婚庆公司' },
      { id: 7295, text: '家政服务' },
      { id: 7395, text: '照片洗印服务' },
      { id: 7523, text: '停车场' },
      { id: 7299, text: '未列入其他代码的个人服务' }
    ]
  },
  {
    text: '商业服务',
    children : [
      { id: 763, text: '农业合作' },
      { id: 780, text: '景观美化及园艺服务' },
      { id: 4722, text: '旅行社' },
      { id: 5811, text: '包办伙食、宴会承包商' },
      { id: 5935, text: '海上船只遇难救助' },
      { id: 7276, text: '税收准备服务' },
      { id: 7277, text: '个人咨询服务' },
      { id: 7278, text: '商品服务买卖居间活动、团购' },
      { id: 7311, text: '广告服务' },
      { id: 7321, text: '信用调查与征信服务' },
      { id: 7333, text: '商业摄影、平面设计' },
      { id: 7338, text: '复印及绘图服务' },
      { id: 7339, text: '办公、文秘服务' },
      { id: 7361, text: '职业介绍与人才服务' },
      { id: 7392, text: '管理咨询与公共关系服务' },
      { id: 7393, text: '安全保卫服务' },
      { id: 7549, text: '拖车服务' },
      { id: 8111, text: '法律事务' },
      { id: 8675, text: '汽车协会' },
      { id: 8931, text: '会计、审计、财务服务' },
      { id: 7399, text: '未列入其他代码的商业服务' },
      { id: 8911, text: '工业设计、建筑与工程设计' },
      { id: 8912, text: '装修装潢服务' }
    ]
  },
  {
    text: '出租和租赁服务',
    children : [
      { id: 4457, text: '出租船只' },
      { id: 4468, text: '码头、船只停泊与维修服务' },
      { id: 7296, text: '服装出租' },
      { id: 7394, text: '设备出租服务' },
      { id: 7512, text: '汽车出租' },
      { id: 7513, text: '卡车、拖车与农机出租' },
      { id: 7519, text: '房车和娱乐车辆出租' },
      { id: 7841, text: '音像制品出租服务' }
    ]
  },
  {
    text: '交通运输、物流和仓储服务',
    children : [
      { id: 4011, text: '铁路货运服务' },
      { id: 3998, text: '国家铁路总公司' },
      { id: 4111, text: '本市和市郊通勤旅客运输（包括轮渡）' },
      { id: 4112, text: '铁路客运' },
      { id: 4119, text: '救护车服务' },
      { id: 4121, text: '出租车服务' },
      { id: 4131, text: '公路客运' },
      { id: 4214, text: '物流服务' },
      { id: 4215, text: '快递公司' },
      { id: 4225, text: '仓储服务' },
      { id: 4411, text: '旅客航运服务' },
      { id: 4511, text: '航空公司、航空客票销售' },
      { id: 4582, text: '机场、停机坪、飞机停靠与维修服务' },
      { id: 4784, text: '路桥通行费' },
      { id: 4789, text: '未列入其他代码的运输服务' },
      { id: 9402, text: '国家邮政服务' }
    ]
  },
  {
    text: '信息与计算机服务',
    children : [
      { id: 4814, text: '电信运营商' },
      { id: 4816, text: '网络接入服务' },
      { id: 4821, text: '电报服务' },
      { id: 7372, text: '计算机软件开发、系统集成、数据处理服务' },
      { id: 7375, text: '网站运营与信息检索服务' },
      { id: 4899, text: '付费电视' }
    ]
  },
  {
    text: '维修及其他专业服务',
    children : [
      { id: 742, text: '兽医服务' },
      { id: 6513, text: '物业管理' },
      { id: 7251, text: '鞋帽清洗保养服务' },
      { id: 7342, text: '灭虫及消毒服务' },
      { id: 7349, text: '保洁服务' },
      { id: 7379, text: '未列入其他代码的计算机维护和修理服务' },
      { id: 7531, text: '车体维修店' },
      { id: 7534, text: '轮胎翻新、维修店' },
      { id: 7535, text: '汽车喷漆店' },
      { id: 7538, text: '机动车维修保养' },
      { id: 7542, text: '洗车服务' },
      { id: 7622, text: '电气设备维修' },
      { id: 7623, text: '空调、制冷设备维修' },
      { id: 7629, text: '小家电维修' },
      { id: 7631, text: '手表、钟表和首饰维修店' },
      { id: 7641, text: '家具维修、翻新' },
      { id: 7692, text: '焊接维修服务' },
      { id: 7699, text: '未列入其他代码的维修服务' },
      { id: 8999, text: '未列入其他代码的专业服务' }
    ]
  },
  {
    text: '教育',
    children : [
      { id: 8211, text: '中小高校' },
      { id: 8220, text: '普通高校' },
      { id: 8241, text: '函授学校（成人教育）' },
      { id: 8244, text: '商业和文秘学校' },
      { id: 8249, text: '职业技能培训' },
      { id: 8299, text: '其他学校和教育服务' },
      { id: 8351, text: '学前教育' }
    ]
  },
  {
    text: '卫生',
    children : [
      { id: 8011, text: '其他医疗机构' },
      { id: 8021, text: '牙科诊所' },
      { id: 8031, text: '正骨医生' },
      { id: 8041, text: '按摩医生' },
      { id: 8042, text: '眼科医生' },
      { id: 8049, text: '手足病医生' },
      { id: 8050, text: '医疗护理和看护服务' },
      { id: 8062, text: '医院' },
      { id: 8071, text: '医学检验与牙科设备服务' },
      { id: 8099, text: '公共卫生服务机构' }
    ]
  },
  {
    text: '社会组织',
    children : [
      { id: 8641, text: '社会团体与行业协会' },
      { id: 8651, text: '政府机构' },
      { id: 8661, text: '宗教组织' },
      { id: 8699, text: '未列入其他代码的会员组织' }
    ]
  },
  {
    text: '批发商户',
    children : [
      { id: 5013, text: '机动车、农机零配件批发' },
      { id: 5021, text: '办公及商务家具批发' },
      { id: 5039, text: '建筑装饰材料批发' },
      { id: 5044, text: '办公设备批发商' },
      { id: 5045, text: '计算机及外设批发' },
      { id: 5046, text: '未列入其他代码的商用机械设备批发' },
      { id: 5047, text: '医疗器械批发' },
      { id: 5051, text: '金属材料批发' },
      { id: 5065, text: '电器零件与通信器材批发' },
      { id: 5072, text: '五金批发' },
      { id: 5074, text: '管道与供暖设备批发' },
      { id: 5111, text: '文教用品批发' },
      { id: 5122, text: '药品批发' },
      { id: 5131, text: '纺织原料及日用品批发' },
      { id: 5137, text: '服装、化妆品、卫生用品批发' },
      { id: 5139, text: '鞋帽批发' },
      { id: 5172, text: '石化产品批发' },
      { id: 5192, text: '书报批发' },
      { id: 5193, text: '花卉苗木批发' },
      { id: 5198, text: '涂料批发' },
      { id: 5398, text: '大型企业批发' },
      { id: 4458, text: '烟草配送' },
      { id: 5998, text: '其他批发商' }
    ]
  }
]

module.exports = data
